Revit 2024 API
AddInId Properties
The AddInId type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
AddInId Class
Autodesk.Revit.DB Namespace